#+TITLE: 詳説正規表現
#+PROPERTY: header-args :results scalar
**** 複数の文字のどれか一つとマッチさせる []
grey と gray を検索するには
#+BEGIN_SRC sh
echo 'I wear grey T-shirt,
yellow pants,
green shoes,
and gray cap.' | egrep 'gr[ae]y'
#+END_SRC

#+RESULTS:
: I wear grey T-shirt,
: and gray cap.
***** 文字クラスの中での振る舞い
[0-9A-Z_!.?] とすると数字，大文字，アンダースコア，感嘆符， *ピリオド* ，疑問符にマッチする．
文字クラスの中ではピリオドはメタ文字ではない．

一方，ダッシュは，範囲を表すメタ文字になる．
ところが文字クラス内の先頭や末尾に置いた場合は範囲を示せないので，ダッシュ文字そのものとして認識される．
#+BEGIN_SRC sh
echo 'ピリオド'
echo 'I like high-lows' | egrep 'high[.]lows'
echo '範囲指定ダッシュ'
echo 'I like high-lows' | egrep 'high[0-9]lows'
echo '頭のダッシュ'
echo 'I like high-lows' | egrep 'high[-9]lows'
echo '末尾のダッシュ'
echo 'I like high-lows' | egrep 'high[9-]lows'
echo '1つのダッシュ'
echo 'I like high-lows' | egrep 'high[-]lows'

#+END_SRC

#+RESULTS:
: ピリオド
: 範囲指定ダッシュ
: 頭のダッシュ
: I like high-lows
: 末尾のダッシュ
: I like high-lows
: 1つのダッシュ
: I like high-lows

**** 否定文字クラス [^]
リストに含まれて *いない* 任意の文字にマッチする．
#+BEGIN_SRC sh
echo 1
echo 'abcdef' | egrep '[^a]bcdef'
echo 2
echo 'abcdef' | egrep '[^xyz]bcdef'
#+END_SRC

#+RESULTS:
: 1
: 2
: abcdef

***** 振る舞い
文字クラス内の先頭に置かれた時に，メタ文字として機能する．
普段はご存知の通り，行頭アンカー．

#+BEGIN_SRC sh
echo 否定メタ文字として機能．エスケープも必要．
echo ab^cdef | egrep [^a]b\\^cdef
echo ただのキャレットとして機能
echo ab^cdef | egrep [z^]

#+END_SRC

#+RESULTS:
: 否定メタ文字として機能．エスケープも必要．
: ただのキャレットとして機能
: ab^cdef

